app/controllers/comments_controller.rb

  def new
    @comment = Comment.find_by(id: params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @comment = @post.comments.new(messages:  params[:messages],
                                  user:      params[:by],
                                  parent_id: params[:parent_id],
                                  story_id:  params[:id])
    if @comment.save
---
INSERT INTO "comments" ("story_id", "messages", "user", "parent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["story_id", 30], ["messages", "Hi kathir"], ["user", "aszepieniec"], ["parent_id", nil], ["created_at", "2023-01-25 18:19:34.932565"], ["updated_at", "2023-01-25 18:19:34.932565"]]

  def set_post
    @post = Story.find_by(id: params[:id] || params[:format])
    return if @post.present?
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]