app/controllers/home_page_controller.rb

  def index
    @posts = Story.all.order(created_at: :desc)
---
SELECT "stories".* FROM "stories" ORDER BY "stories"."created_at" DESC

  def set_post
    @post = Story.find_by(id: params[:id])
    return if @post.present?
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]